feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxHssl_bf.h
/** \brief  Mask for Ifx_HSSL_AR_Bits.MAVCH */
#define IFX_HSSL_AR_MAVCH_MSK (0x3u)

/** \brief  Offset for Ifx_HSSL_AR_Bits.MAVCH */
#define IFX_HSSL_AR_MAVCH_OFF (16u)

/** \brief  Length for Ifx_HSSL_AW_AWEND_Bits.AWE */
#define IFX_HSSL_AW_AWEND_AWE_LEN (24u)

/** \brief  Mask for Ifx_HSSL_AW_AWEND_Bits.AWE */
#define IFX_HSSL_AW_AWEND_AWE_MSK (0xffffffu)

/** \brief  Offset for Ifx_HSSL_AW_AWEND_Bits.AWE */
#define IFX_HSSL_AW_AWEND_AWE_OFF (8u)

/** \brief  Length for Ifx_HSSL_AW_AWSTART_Bits.AWS */
#define IFX_HSSL_AW_AWSTART_AWS_LEN (24u)

/** \brief  Mask for Ifx_HSSL_AW_AWSTART_Bits.AWS */
#define IFX_HSSL_AW_AWSTART_AWS_MSK (0xffffffu)

/** \brief  Offset for Ifx_HSSL_AW_AWSTART_Bits.AWS */
#define IFX_HSSL_AW_AWSTART_AWS_OFF (8u)

/** \brief  Length for Ifx_HSSL_CFG_Bits.CCC */
#define IFX_HSSL_CFG_CCC_LEN (1u)

/** \brief  Mask for Ifx_HSSL_CFG_Bits.CCC */
#define IFX_HSSL_CFG_CCC_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_CFG_Bits.CCC */
#define IFX_HSSL_CFG_CCC_OFF (19u)

/** \brief  Length for Ifx_HSSL_CFG_Bits.PREDIV */
#define IFX_HSSL_CFG_PREDIV_LEN (14u)

/** \brief  Mask for Ifx_HSSL_CFG_Bits.PREDIV */
#define IFX_HSSL_CFG_PREDIV_MSK (0x3fffu)

/** \brief  Offset for Ifx_HSSL_CFG_Bits.PREDIV */
#define IFX_HSSL_CFG_PREDIV_OFF (0u)

/** \brief  Length for Ifx_HSSL_CFG_Bits.SCM */
#define IFX_HSSL_CFG_SCM_LEN (1u)

/** \brief  Mask for Ifx_HSSL_CFG_Bits.SCM */
#define IFX_HSSL_CFG_SCM_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_CFG_Bits.SCM */
#define IFX_HSSL_CFG_SCM_OFF (18u)

/** \brief  Length for Ifx_HSSL_CFG_Bits.SMR */
#define IFX_HSSL_CFG_SMR_LEN (1u)

/** \brief  Mask for Ifx_HSSL_CFG_Bits.SMR */
#define IFX_HSSL_CFG_SMR_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_CFG_Bits.SMR */
#define IFX_HSSL_CFG_SMR_OFF (17u)

/** \brief  Length for Ifx_HSSL_CFG_Bits.SMT */
#define IFX_HSSL_CFG_SMT_LEN (1u)

/** \brief  Mask for Ifx_HSSL_CFG_Bits.SMT */
#define IFX_HSSL_CFG_SMT_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_CFG_Bits.SMT */
#define IFX_HSSL_CFG_SMT_OFF (16u)

/** \brief  Length for Ifx_HSSL_CLC_Bits.DISR */
#define IFX_HSSL_CLC_DISR_LEN (1u)

/** \brief  Mask for Ifx_HSSL_CLC_Bits.DISR */
#define IFX_HSSL_CLC_DISR_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_CLC_Bits.DISR */
#define IFX_HSSL_CLC_DISR_OFF (0u)

/** \brief  Length for Ifx_HSSL_CLC_Bits.DISS */
#define IFX_HSSL_CLC_DISS_LEN (1u)

/** \brief  Mask for Ifx_HSSL_CLC_Bits.DISS */
#define IFX_HSSL_CLC_DISS_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_CLC_Bits.DISS */
#define IFX_HSSL_CLC_DISS_OFF (1u)

/** \brief  Length for Ifx_HSSL_CLC_Bits.EDIS */
#define IFX_HSSL_CLC_EDIS_LEN (1u)

/** \brief  Mask for Ifx_HSSL_CLC_Bits.EDIS */
#define IFX_HSSL_CLC_EDIS_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_CLC_Bits.EDIS */
#define IFX_HSSL_CLC_EDIS_OFF (3u)

/** \brief  Length for Ifx_HSSL_CRC_Bits.XEN */
#define IFX_HSSL_CRC_XEN_LEN (1u)

/** \brief  Mask for Ifx_HSSL_CRC_Bits.XEN */
#define IFX_HSSL_CRC_XEN_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_CRC_Bits.XEN */
#define IFX_HSSL_CRC_XEN_OFF (16u)

/** \brief  Length for Ifx_HSSL_CRC_Bits.XORMASK */
#define IFX_HSSL_CRC_XORMASK_LEN (16u)

/** \brief  Mask for Ifx_HSSL_CRC_Bits.XORMASK */
#define IFX_HSSL_CRC_XORMASK_MSK (0xffffu)

/** \brief  Offset for Ifx_HSSL_CRC_Bits.XORMASK */
#define IFX_HSSL_CRC_XORMASK_OFF (0u)

/** \brief  Length for Ifx_HSSL_I_ICON_Bits.BSY */
#define IFX_HSSL_I_ICON_BSY_LEN (1u)

/** \brief  Mask for Ifx_HSSL_I_ICON_Bits.BSY */
#define IFX_HSSL_I_ICON_BSY_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_I_ICON_Bits.BSY */
#define IFX_HSSL_I_ICON_BSY_OFF (20u)

/** \brief  Length for Ifx_HSSL_I_ICON_Bits.CETT */
#define IFX_HSSL_I_ICON_CETT_LEN (3u)

/** \brief  Mask for Ifx_HSSL_I_ICON_Bits.CETT */
#define IFX_HSSL_I_ICON_CETT_MSK (0x7u)

/** \brief  Offset for Ifx_HSSL_I_ICON_Bits.CETT */
#define IFX_HSSL_I_ICON_CETT_OFF (5u)

/** \brief  Length for Ifx_HSSL_I_ICON_Bits.DATLEN */
#define IFX_HSSL_I_ICON_DATLEN_LEN (2u)

/** \brief  Mask for Ifx_HSSL_I_ICON_Bits.DATLEN */
#define IFX_HSSL_I_ICON_DATLEN_MSK (0x3u)

/** \brief  Offset for Ifx_HSSL_I_ICON_Bits.DATLEN */
#define IFX_HSSL_I_ICON_DATLEN_OFF (16u)

/** \brief  Length for Ifx_HSSL_I_ICON_Bits.IDQ */
#define IFX_HSSL_I_ICON_IDQ_LEN (1u)

/** \brief  Mask for Ifx_HSSL_I_ICON_Bits.IDQ */
#define IFX_HSSL_I_ICON_IDQ_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_I_ICON_Bits.IDQ */
#define IFX_HSSL_I_ICON_IDQ_OFF (0u)

/** \brief  Length for Ifx_HSSL_I_ICON_Bits.ITTAG */
#define IFX_HSSL_I_ICON_ITTAG_LEN (3u)

/** \brief  Mask for Ifx_HSSL_I_ICON_Bits.ITTAG */
#define IFX_HSSL_I_ICON_ITTAG_MSK (0x7u)

/** \brief  Offset for Ifx_HSSL_I_ICON_Bits.ITTAG */
#define IFX_HSSL_I_ICON_ITTAG_OFF (21u)

/** \brief  Length for Ifx_HSSL_I_ICON_Bits.LETT */
#define IFX_HSSL_I_ICON_LETT_LEN (3u)

/** \brief  Mask for Ifx_HSSL_I_ICON_Bits.LETT */
#define IFX_HSSL_I_ICON_LETT_MSK (0x7u)

/** \brief  Offset for Ifx_HSSL_I_ICON_Bits.LETT */
#define IFX_HSSL_I_ICON_LETT_OFF (2u)

/** \brief  Length for Ifx_HSSL_I_ICON_Bits.RWT */
#define IFX_HSSL_I_ICON_RWT_LEN (2u)

/** \brief  Mask for Ifx_HSSL_I_ICON_Bits.RWT */
#define IFX_HSSL_I_ICON_RWT_MSK (0x3u)

/** \brief  Offset for Ifx_HSSL_I_ICON_Bits.RWT */
#define IFX_HSSL_I_ICON_RWT_OFF (18u)

/** \brief  Length for Ifx_HSSL_I_ICON_Bits.TOCV */
#define IFX_HSSL_I_ICON_TOCV_LEN (8u)

/** \brief  Mask for Ifx_HSSL_I_ICON_Bits.TOCV */
#define IFX_HSSL_I_ICON_TOCV_MSK (0xffu)

/** \brief  Offset for Ifx_HSSL_I_ICON_Bits.TOCV */
#define IFX_HSSL_I_ICON_TOCV_OFF (8u)

/** \brief  Length for Ifx_HSSL_I_ICON_Bits.TOREL */
#define IFX_HSSL_I_ICON_TOREL_LEN (8u)

/** \brief  Mask for Ifx_HSSL_I_ICON_Bits.TOREL */
#define IFX_HSSL_I_ICON_TOREL_MSK (0xffu)

/** \brief  Offset for Ifx_HSSL_I_ICON_Bits.TOREL */
#define IFX_HSSL_I_ICON_TOREL_OFF (24u)

/** \brief  Length for Ifx_HSSL_I_ICON_Bits.TQ */
#define IFX_HSSL_I_ICON_TQ_LEN (1u)

/** \brief  Mask for Ifx_HSSL_I_ICON_Bits.TQ */
#define IFX_HSSL_I_ICON_TQ_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_I_ICON_Bits.TQ */
#define IFX_HSSL_I_ICON_TQ_OFF (1u)

