feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxHssl_bf.h
/** \brief  Length for Ifx_HSSL_I_IRD_Bits.DATA */
#define IFX_HSSL_I_IRD_DATA_LEN (32u)

/** \brief  Mask for Ifx_HSSL_I_IRD_Bits.DATA */
#define IFX_HSSL_I_IRD_DATA_MSK (0xffffffffu)

/** \brief  Offset for Ifx_HSSL_I_IRD_Bits.DATA */
#define IFX_HSSL_I_IRD_DATA_OFF (0u)

/** \brief  Length for Ifx_HSSL_I_IRWA_Bits.ADDRESS */
#define IFX_HSSL_I_IRWA_ADDRESS_LEN (32u)

/** \brief  Mask for Ifx_HSSL_I_IRWA_Bits.ADDRESS */
#define IFX_HSSL_I_IRWA_ADDRESS_MSK (0xffffffffu)

/** \brief  Offset for Ifx_HSSL_I_IRWA_Bits.ADDRESS */
#define IFX_HSSL_I_IRWA_ADDRESS_OFF (0u)

/** \brief  Length for Ifx_HSSL_I_IWD_Bits.DATA */
#define IFX_HSSL_I_IWD_DATA_LEN (32u)

/** \brief  Mask for Ifx_HSSL_I_IWD_Bits.DATA */
#define IFX_HSSL_I_IWD_DATA_MSK (0xffffffffu)

/** \brief  Offset for Ifx_HSSL_I_IWD_Bits.DATA */
#define IFX_HSSL_I_IWD_DATA_OFF (0u)

/** \brief  Length for Ifx_HSSL_ID_Bits.MODNUMBER */
#define IFX_HSSL_ID_MODNUMBER_LEN (16u)

/** \brief  Mask for Ifx_HSSL_ID_Bits.MODNUMBER */
#define IFX_HSSL_ID_MODNUMBER_MSK (0xffffu)

/** \brief  Offset for Ifx_HSSL_ID_Bits.MODNUMBER */
#define IFX_HSSL_ID_MODNUMBER_OFF (16u)

/** \brief  Length for Ifx_HSSL_ID_Bits.MODREV */
#define IFX_HSSL_ID_MODREV_LEN (8u)

/** \brief  Mask for Ifx_HSSL_ID_Bits.MODREV */
#define IFX_HSSL_ID_MODREV_MSK (0xffu)

/** \brief  Offset for Ifx_HSSL_ID_Bits.MODREV */
#define IFX_HSSL_ID_MODREV_OFF (0u)

/** \brief  Length for Ifx_HSSL_ID_Bits.MODTYPE */
#define IFX_HSSL_ID_MODTYPE_LEN (8u)

/** \brief  Mask for Ifx_HSSL_ID_Bits.MODTYPE */
#define IFX_HSSL_ID_MODTYPE_MSK (0xffu)

/** \brief  Offset for Ifx_HSSL_ID_Bits.MODTYPE */
#define IFX_HSSL_ID_MODTYPE_OFF (8u)

/** \brief  Length for Ifx_HSSL_IS_CA_Bits.CURR */
#define IFX_HSSL_IS_CA_CURR_LEN (27u)

/** \brief  Mask for Ifx_HSSL_IS_CA_Bits.CURR */
#define IFX_HSSL_IS_CA_CURR_MSK (0x7ffffffu)

/** \brief  Offset for Ifx_HSSL_IS_CA_Bits.CURR */
#define IFX_HSSL_IS_CA_CURR_OFF (5u)

/** \brief  Length for Ifx_HSSL_IS_FC_Bits.CURCOUNT */
#define IFX_HSSL_IS_FC_CURCOUNT_LEN (16u)

/** \brief  Mask for Ifx_HSSL_IS_FC_Bits.CURCOUNT */
#define IFX_HSSL_IS_FC_CURCOUNT_MSK (0xffffu)

/** \brief  Offset for Ifx_HSSL_IS_FC_Bits.CURCOUNT */
#define IFX_HSSL_IS_FC_CURCOUNT_OFF (16u)

/** \brief  Length for Ifx_HSSL_IS_FC_Bits.RELCOUNT */
#define IFX_HSSL_IS_FC_RELCOUNT_LEN (16u)

/** \brief  Mask for Ifx_HSSL_IS_FC_Bits.RELCOUNT */
#define IFX_HSSL_IS_FC_RELCOUNT_MSK (0xffffu)

/** \brief  Offset for Ifx_HSSL_IS_FC_Bits.RELCOUNT */
#define IFX_HSSL_IS_FC_RELCOUNT_OFF (0u)

/** \brief  Length for Ifx_HSSL_ISSA_Bits.START */
#define IFX_HSSL_ISSA_START_LEN (27u)

/** \brief  Mask for Ifx_HSSL_ISSA_Bits.START */
#define IFX_HSSL_ISSA_START_MSK (0x7ffffffu)

/** \brief  Offset for Ifx_HSSL_ISSA_Bits.START */
#define IFX_HSSL_ISSA_START_OFF (5u)

/** \brief  Length for Ifx_HSSL_KRST0_Bits.RST */
#define IFX_HSSL_KRST0_RST_LEN (1u)

/** \brief  Mask for Ifx_HSSL_KRST0_Bits.RST */
#define IFX_HSSL_KRST0_RST_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_KRST0_Bits.RST */
#define IFX_HSSL_KRST0_RST_OFF (0u)

/** \brief  Length for Ifx_HSSL_KRST0_Bits.RSTSTAT */
#define IFX_HSSL_KRST0_RSTSTAT_LEN (1u)

/** \brief  Mask for Ifx_HSSL_KRST0_Bits.RSTSTAT */
#define IFX_HSSL_KRST0_RSTSTAT_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_KRST0_Bits.RSTSTAT */
#define IFX_HSSL_KRST0_RSTSTAT_OFF (1u)

/** \brief  Length for Ifx_HSSL_KRST1_Bits.RST */
#define IFX_HSSL_KRST1_RST_LEN (1u)

/** \brief  Mask for Ifx_HSSL_KRST1_Bits.RST */
#define IFX_HSSL_KRST1_RST_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_KRST1_Bits.RST */
#define IFX_HSSL_KRST1_RST_OFF (0u)

/** \brief  Length for Ifx_HSSL_KRSTCLR_Bits.CLR */
#define IFX_HSSL_KRSTCLR_CLR_LEN (1u)

/** \brief  Mask for Ifx_HSSL_KRSTCLR_Bits.CLR */
#define IFX_HSSL_KRSTCLR_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_KRSTCLR_Bits.CLR */
#define IFX_HSSL_KRSTCLR_CLR_OFF (0u)

/** \brief  Length for Ifx_HSSL_MFLAGS_Bits.CRCE */
#define IFX_HSSL_MFLAGS_CRCE_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGS_Bits.CRCE */
#define IFX_HSSL_MFLAGS_CRCE_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGS_Bits.CRCE */
#define IFX_HSSL_MFLAGS_CRCE_OFF (25u)

/** \brief  Length for Ifx_HSSL_MFLAGS_Bits.IMB */
#define IFX_HSSL_MFLAGS_IMB_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGS_Bits.IMB */
#define IFX_HSSL_MFLAGS_IMB_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGS_Bits.IMB */
#define IFX_HSSL_MFLAGS_IMB_OFF (19u)

/** \brief  Length for Ifx_HSSL_MFLAGS_Bits.INI */
#define IFX_HSSL_MFLAGS_INI_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGS_Bits.INI */
#define IFX_HSSL_MFLAGS_INI_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGS_Bits.INI */
#define IFX_HSSL_MFLAGS_INI_OFF (31u)

/** \brief  Length for Ifx_HSSL_MFLAGS_Bits.ISB */
#define IFX_HSSL_MFLAGS_ISB_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGS_Bits.ISB */
#define IFX_HSSL_MFLAGS_ISB_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGS_Bits.ISB */
#define IFX_HSSL_MFLAGS_ISB_OFF (20u)

/** \brief  Length for Ifx_HSSL_MFLAGS_Bits.MAV */
#define IFX_HSSL_MFLAGS_MAV_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGS_Bits.MAV */
#define IFX_HSSL_MFLAGS_MAV_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGS_Bits.MAV */
#define IFX_HSSL_MFLAGS_MAV_OFF (21u)

/** \brief  Length for Ifx_HSSL_MFLAGS_Bits.NACK */
#define IFX_HSSL_MFLAGS_NACK_LEN (4u)

/** \brief  Mask for Ifx_HSSL_MFLAGS_Bits.NACK */
#define IFX_HSSL_MFLAGS_NACK_MSK (0xfu)

/** \brief  Offset for Ifx_HSSL_MFLAGS_Bits.NACK */
#define IFX_HSSL_MFLAGS_NACK_OFF (0u)

/** \brief  Length for Ifx_HSSL_MFLAGS_Bits.PIE1 */
#define IFX_HSSL_MFLAGS_PIE1_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGS_Bits.PIE1 */
#define IFX_HSSL_MFLAGS_PIE1_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGS_Bits.PIE1 */
#define IFX_HSSL_MFLAGS_PIE1_OFF (23u)

/** \brief  Length for Ifx_HSSL_MFLAGS_Bits.PIE2 */
#define IFX_HSSL_MFLAGS_PIE2_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGS_Bits.PIE2 */
#define IFX_HSSL_MFLAGS_PIE2_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGS_Bits.PIE2 */
#define IFX_HSSL_MFLAGS_PIE2_OFF (24u)

/** \brief  Length for Ifx_HSSL_MFLAGS_Bits.SRIE */
#define IFX_HSSL_MFLAGS_SRIE_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGS_Bits.SRIE */
#define IFX_HSSL_MFLAGS_SRIE_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGS_Bits.SRIE */
#define IFX_HSSL_MFLAGS_SRIE_OFF (22u)

/** \brief  Length for Ifx_HSSL_MFLAGS_Bits.TEI */
#define IFX_HSSL_MFLAGS_TEI_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGS_Bits.TEI */
#define IFX_HSSL_MFLAGS_TEI_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGS_Bits.TEI */
#define IFX_HSSL_MFLAGS_TEI_OFF (29u)

/** \brief  Length for Ifx_HSSL_MFLAGS_Bits.TEO */
#define IFX_HSSL_MFLAGS_TEO_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGS_Bits.TEO */
#define IFX_HSSL_MFLAGS_TEO_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGS_Bits.TEO */
#define IFX_HSSL_MFLAGS_TEO_OFF (30u)

/** \brief  Length for Ifx_HSSL_MFLAGS_Bits.TIMEOUT */
#define IFX_HSSL_MFLAGS_TIMEOUT_LEN (4u)

/** \brief  Mask for Ifx_HSSL_MFLAGS_Bits.TIMEOUT */
#define IFX_HSSL_MFLAGS_TIMEOUT_MSK (0xfu)

/** \brief  Offset for Ifx_HSSL_MFLAGS_Bits.TIMEOUT */
#define IFX_HSSL_MFLAGS_TIMEOUT_OFF (8u)

/** \brief  Length for Ifx_HSSL_MFLAGS_Bits.TMB */
#define IFX_HSSL_MFLAGS_TMB_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGS_Bits.TMB */
#define IFX_HSSL_MFLAGS_TMB_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGS_Bits.TMB */
#define IFX_HSSL_MFLAGS_TMB_OFF (18u)

/** \brief  Length for Ifx_HSSL_MFLAGS_Bits.TSE */
#define IFX_HSSL_MFLAGS_TSE_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGS_Bits.TSE */
#define IFX_HSSL_MFLAGS_TSE_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGS_Bits.TSE */
#define IFX_HSSL_MFLAGS_TSE_OFF (28u)

/** \brief  Length for Ifx_HSSL_MFLAGS_Bits.TTE */
#define IFX_HSSL_MFLAGS_TTE_LEN (4u)

/** \brief  Mask for Ifx_HSSL_MFLAGS_Bits.TTE */
#define IFX_HSSL_MFLAGS_TTE_MSK (0xfu)

/** \brief  Offset for Ifx_HSSL_MFLAGS_Bits.TTE */
#define IFX_HSSL_MFLAGS_TTE_OFF (4u)

