feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxHssl_bf.h
/** \brief  Length for Ifx_HSSL_MFLAGS_Bits.UNEXPECTED */
#define IFX_HSSL_MFLAGS_UNEXPECTED_LEN (4u)

/** \brief  Mask for Ifx_HSSL_MFLAGS_Bits.UNEXPECTED */
#define IFX_HSSL_MFLAGS_UNEXPECTED_MSK (0xfu)

/** \brief  Offset for Ifx_HSSL_MFLAGS_Bits.UNEXPECTED */
#define IFX_HSSL_MFLAGS_UNEXPECTED_OFF (12u)

/** \brief  Length for Ifx_HSSL_MFLAGSCL_Bits.CRCEC */
#define IFX_HSSL_MFLAGSCL_CRCEC_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.CRCEC */
#define IFX_HSSL_MFLAGSCL_CRCEC_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.CRCEC */
#define IFX_HSSL_MFLAGSCL_CRCEC_OFF (25u)

/** \brief  Length for Ifx_HSSL_MFLAGSCL_Bits.IMBC */
#define IFX_HSSL_MFLAGSCL_IMBC_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.IMBC */
#define IFX_HSSL_MFLAGSCL_IMBC_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.IMBC */
#define IFX_HSSL_MFLAGSCL_IMBC_OFF (19u)

/** \brief  Length for Ifx_HSSL_MFLAGSCL_Bits.INIC */
#define IFX_HSSL_MFLAGSCL_INIC_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.INIC */
#define IFX_HSSL_MFLAGSCL_INIC_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.INIC */
#define IFX_HSSL_MFLAGSCL_INIC_OFF (31u)

/** \brief  Length for Ifx_HSSL_MFLAGSCL_Bits.ISBC */
#define IFX_HSSL_MFLAGSCL_ISBC_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.ISBC */
#define IFX_HSSL_MFLAGSCL_ISBC_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.ISBC */
#define IFX_HSSL_MFLAGSCL_ISBC_OFF (20u)

/** \brief  Length for Ifx_HSSL_MFLAGSCL_Bits.MAVC */
#define IFX_HSSL_MFLAGSCL_MAVC_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.MAVC */
#define IFX_HSSL_MFLAGSCL_MAVC_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.MAVC */
#define IFX_HSSL_MFLAGSCL_MAVC_OFF (21u)

/** \brief  Length for Ifx_HSSL_MFLAGSCL_Bits.NACKC */
#define IFX_HSSL_MFLAGSCL_NACKC_LEN (4u)

/** \brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.NACKC */
#define IFX_HSSL_MFLAGSCL_NACKC_MSK (0xfu)

/** \brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.NACKC */
#define IFX_HSSL_MFLAGSCL_NACKC_OFF (0u)

/** \brief  Length for Ifx_HSSL_MFLAGSCL_Bits.PIE1C */
#define IFX_HSSL_MFLAGSCL_PIE1C_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.PIE1C */
#define IFX_HSSL_MFLAGSCL_PIE1C_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.PIE1C */
#define IFX_HSSL_MFLAGSCL_PIE1C_OFF (23u)

/** \brief  Length for Ifx_HSSL_MFLAGSCL_Bits.PIE2C */
#define IFX_HSSL_MFLAGSCL_PIE2C_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.PIE2C */
#define IFX_HSSL_MFLAGSCL_PIE2C_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.PIE2C */
#define IFX_HSSL_MFLAGSCL_PIE2C_OFF (24u)

/** \brief  Length for Ifx_HSSL_MFLAGSCL_Bits.SRIEC */
#define IFX_HSSL_MFLAGSCL_SRIEC_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.SRIEC */
#define IFX_HSSL_MFLAGSCL_SRIEC_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.SRIEC */
#define IFX_HSSL_MFLAGSCL_SRIEC_OFF (22u)

/** \brief  Length for Ifx_HSSL_MFLAGSCL_Bits.TEOC */
#define IFX_HSSL_MFLAGSCL_TEOC_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.TEOC */
#define IFX_HSSL_MFLAGSCL_TEOC_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.TEOC */
#define IFX_HSSL_MFLAGSCL_TEOC_OFF (30u)

/** \brief  Length for Ifx_HSSL_MFLAGSCL_Bits.TIMEOUTC */
#define IFX_HSSL_MFLAGSCL_TIMEOUTC_LEN (4u)

/** \brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.TIMEOUTC */
#define IFX_HSSL_MFLAGSCL_TIMEOUTC_MSK (0xfu)

/** \brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.TIMEOUTC */
#define IFX_HSSL_MFLAGSCL_TIMEOUTC_OFF (8u)

/** \brief  Length for Ifx_HSSL_MFLAGSCL_Bits.TMBC */
#define IFX_HSSL_MFLAGSCL_TMBC_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.TMBC */
#define IFX_HSSL_MFLAGSCL_TMBC_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.TMBC */
#define IFX_HSSL_MFLAGSCL_TMBC_OFF (18u)

/** \brief  Length for Ifx_HSSL_MFLAGSCL_Bits.TSEC */
#define IFX_HSSL_MFLAGSCL_TSEC_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.TSEC */
#define IFX_HSSL_MFLAGSCL_TSEC_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.TSEC */
#define IFX_HSSL_MFLAGSCL_TSEC_OFF (28u)

/** \brief  Length for Ifx_HSSL_MFLAGSCL_Bits.TTEC */
#define IFX_HSSL_MFLAGSCL_TTEC_LEN (4u)

/** \brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.TTEC */
#define IFX_HSSL_MFLAGSCL_TTEC_MSK (0xfu)

/** \brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.TTEC */
#define IFX_HSSL_MFLAGSCL_TTEC_OFF (4u)

/** \brief  Length for Ifx_HSSL_MFLAGSCL_Bits.UNEXPECTEDC */
#define IFX_HSSL_MFLAGSCL_UNEXPECTEDC_LEN (4u)

/** \brief  Mask for Ifx_HSSL_MFLAGSCL_Bits.UNEXPECTEDC */
#define IFX_HSSL_MFLAGSCL_UNEXPECTEDC_MSK (0xfu)

/** \brief  Offset for Ifx_HSSL_MFLAGSCL_Bits.UNEXPECTEDC */
#define IFX_HSSL_MFLAGSCL_UNEXPECTEDC_OFF (12u)

/** \brief  Length for Ifx_HSSL_MFLAGSEN_Bits.CRCEEN */
#define IFX_HSSL_MFLAGSEN_CRCEEN_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGSEN_Bits.CRCEEN */
#define IFX_HSSL_MFLAGSEN_CRCEEN_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGSEN_Bits.CRCEEN */
#define IFX_HSSL_MFLAGSEN_CRCEEN_OFF (25u)

/** \brief  Length for Ifx_HSSL_MFLAGSEN_Bits.MAVEN */
#define IFX_HSSL_MFLAGSEN_MAVEN_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGSEN_Bits.MAVEN */
#define IFX_HSSL_MFLAGSEN_MAVEN_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGSEN_Bits.MAVEN */
#define IFX_HSSL_MFLAGSEN_MAVEN_OFF (21u)

/** \brief  Length for Ifx_HSSL_MFLAGSEN_Bits.NACKEN */
#define IFX_HSSL_MFLAGSEN_NACKEN_LEN (4u)

/** \brief  Mask for Ifx_HSSL_MFLAGSEN_Bits.NACKEN */
#define IFX_HSSL_MFLAGSEN_NACKEN_MSK (0xfu)

/** \brief  Offset for Ifx_HSSL_MFLAGSEN_Bits.NACKEN */
#define IFX_HSSL_MFLAGSEN_NACKEN_OFF (0u)

/** \brief  Length for Ifx_HSSL_MFLAGSEN_Bits.PIE1EN */
#define IFX_HSSL_MFLAGSEN_PIE1EN_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGSEN_Bits.PIE1EN */
#define IFX_HSSL_MFLAGSEN_PIE1EN_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_MFLAGSEN_Bits.PIE1EN */
#define IFX_HSSL_MFLAGSEN_PIE1EN_OFF (23u)

/** \brief  Length for Ifx_HSSL_MFLAGSEN_Bits.PIE2EN */
#define IFX_HSSL_MFLAGSEN_PIE2EN_LEN (1u)

/** \brief  Mask for Ifx_HSSL_MFLAGSEN_Bits.PIE2EN */
#define IFX_HSSL_MFLAGSEN_PIE2EN_MSK (0x1u)

