feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxHssl_bf.h
/** \brief  Length for Ifx_HSSL_OCS_Bits.SUSSTA */
#define IFX_HSSL_OCS_SUSSTA_LEN (1u)

/** \brief  Mask for Ifx_HSSL_OCS_Bits.SUSSTA */
#define IFX_HSSL_OCS_SUSSTA_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_OCS_Bits.SUSSTA */
#define IFX_HSSL_OCS_SUSSTA_OFF (29u)

/** \brief  Length for Ifx_HSSL_OCS_Bits.TG_P */
#define IFX_HSSL_OCS_TG_P_LEN (1u)

/** \brief  Mask for Ifx_HSSL_OCS_Bits.TG_P */
#define IFX_HSSL_OCS_TG_P_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_OCS_Bits.TG_P */
#define IFX_HSSL_OCS_TG_P_OFF (3u)

/** \brief  Length for Ifx_HSSL_OCS_Bits.TGB */
#define IFX_HSSL_OCS_TGB_LEN (1u)

/** \brief  Mask for Ifx_HSSL_OCS_Bits.TGB */
#define IFX_HSSL_OCS_TGB_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_OCS_Bits.TGB */
#define IFX_HSSL_OCS_TGB_OFF (2u)

/** \brief  Length for Ifx_HSSL_OCS_Bits.TGS */
#define IFX_HSSL_OCS_TGS_LEN (2u)

/** \brief  Mask for Ifx_HSSL_OCS_Bits.TGS */
#define IFX_HSSL_OCS_TGS_MSK (0x3u)

/** \brief  Offset for Ifx_HSSL_OCS_Bits.TGS */
#define IFX_HSSL_OCS_TGS_OFF (0u)

/** \brief  Length for Ifx_HSSL_QFLAGS_Bits.E0 */
#define IFX_HSSL_QFLAGS_E0_LEN (2u)

/** \brief  Mask for Ifx_HSSL_QFLAGS_Bits.E0 */
#define IFX_HSSL_QFLAGS_E0_MSK (0x3u)

/** \brief  Offset for Ifx_HSSL_QFLAGS_Bits.E0 */
#define IFX_HSSL_QFLAGS_E0_OFF (16u)

/** \brief  Length for Ifx_HSSL_QFLAGS_Bits.E1 */
#define IFX_HSSL_QFLAGS_E1_LEN (2u)

/** \brief  Mask for Ifx_HSSL_QFLAGS_Bits.E1 */
#define IFX_HSSL_QFLAGS_E1_MSK (0x3u)

/** \brief  Offset for Ifx_HSSL_QFLAGS_Bits.E1 */
#define IFX_HSSL_QFLAGS_E1_OFF (18u)

/** \brief  Length for Ifx_HSSL_QFLAGS_Bits.E2 */
#define IFX_HSSL_QFLAGS_E2_LEN (2u)

/** \brief  Mask for Ifx_HSSL_QFLAGS_Bits.E2 */
#define IFX_HSSL_QFLAGS_E2_MSK (0x3u)

/** \brief  Offset for Ifx_HSSL_QFLAGS_Bits.E2 */
#define IFX_HSSL_QFLAGS_E2_OFF (20u)

/** \brief  Length for Ifx_HSSL_QFLAGS_Bits.E3 */
#define IFX_HSSL_QFLAGS_E3_LEN (2u)

/** \brief  Mask for Ifx_HSSL_QFLAGS_Bits.E3 */
#define IFX_HSSL_QFLAGS_E3_MSK (0x3u)

/** \brief  Offset for Ifx_HSSL_QFLAGS_Bits.E3 */
#define IFX_HSSL_QFLAGS_E3_OFF (22u)

/** \brief  Length for Ifx_HSSL_QFLAGS_Bits.ES */
#define IFX_HSSL_QFLAGS_ES_LEN (1u)

/** \brief  Mask for Ifx_HSSL_QFLAGS_Bits.ES */
#define IFX_HSSL_QFLAGS_ES_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_QFLAGS_Bits.ES */
#define IFX_HSSL_QFLAGS_ES_OFF (31u)

/** \brief  Length for Ifx_HSSL_QFLAGS_Bits.I */
#define IFX_HSSL_QFLAGS_I_LEN (4u)

/** \brief  Mask for Ifx_HSSL_QFLAGS_Bits.I */
#define IFX_HSSL_QFLAGS_I_MSK (0xfu)

/** \brief  Offset for Ifx_HSSL_QFLAGS_Bits.I */
#define IFX_HSSL_QFLAGS_I_OFF (0u)

/** \brief  Length for Ifx_HSSL_QFLAGS_Bits.IS */
#define IFX_HSSL_QFLAGS_IS_LEN (1u)

/** \brief  Mask for Ifx_HSSL_QFLAGS_Bits.IS */
#define IFX_HSSL_QFLAGS_IS_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_QFLAGS_Bits.IS */
#define IFX_HSSL_QFLAGS_IS_OFF (28u)

/** \brief  Length for Ifx_HSSL_QFLAGS_Bits.R */
#define IFX_HSSL_QFLAGS_R_LEN (4u)

/** \brief  Mask for Ifx_HSSL_QFLAGS_Bits.R */
#define IFX_HSSL_QFLAGS_R_MSK (0xfu)

/** \brief  Offset for Ifx_HSSL_QFLAGS_Bits.R */
#define IFX_HSSL_QFLAGS_R_OFF (8u)

/** \brief  Length for Ifx_HSSL_QFLAGS_Bits.RS */
#define IFX_HSSL_QFLAGS_RS_LEN (1u)

/** \brief  Mask for Ifx_HSSL_QFLAGS_Bits.RS */
#define IFX_HSSL_QFLAGS_RS_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_QFLAGS_Bits.RS */
#define IFX_HSSL_QFLAGS_RS_OFF (29u)

/** \brief  Length for Ifx_HSSL_QFLAGS_Bits.T */
#define IFX_HSSL_QFLAGS_T_LEN (4u)

/** \brief  Mask for Ifx_HSSL_QFLAGS_Bits.T */
#define IFX_HSSL_QFLAGS_T_MSK (0xfu)

/** \brief  Offset for Ifx_HSSL_QFLAGS_Bits.T */
#define IFX_HSSL_QFLAGS_T_OFF (4u)

/** \brief  Length for Ifx_HSSL_QFLAGS_Bits.TS */
#define IFX_HSSL_QFLAGS_TS_LEN (1u)

/** \brief  Mask for Ifx_HSSL_QFLAGS_Bits.TS */
#define IFX_HSSL_QFLAGS_TS_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_QFLAGS_Bits.TS */
#define IFX_HSSL_QFLAGS_TS_OFF (30u)

/** \brief  Length for Ifx_HSSL_SFSFLAGS_Bits.EXFL */
#define IFX_HSSL_SFSFLAGS_EXFL_LEN (2u)

/** \brief  Mask for Ifx_HSSL_SFSFLAGS_Bits.EXFL */
#define IFX_HSSL_SFSFLAGS_EXFL_MSK (0x3u)

/** \brief  Offset for Ifx_HSSL_SFSFLAGS_Bits.EXFL */
#define IFX_HSSL_SFSFLAGS_EXFL_OFF (4u)

/** \brief  Length for Ifx_HSSL_SFSFLAGS_Bits.ISF */
#define IFX_HSSL_SFSFLAGS_ISF_LEN (1u)

/** \brief  Mask for Ifx_HSSL_SFSFLAGS_Bits.ISF */
#define IFX_HSSL_SFSFLAGS_ISF_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_SFSFLAGS_Bits.ISF */
#define IFX_HSSL_SFSFLAGS_ISF_OFF (15u)

/** \brief  Length for Ifx_HSSL_SFSFLAGS_Bits.RXFL */
#define IFX_HSSL_SFSFLAGS_RXFL_LEN (2u)

/** \brief  Mask for Ifx_HSSL_SFSFLAGS_Bits.RXFL */
#define IFX_HSSL_SFSFLAGS_RXFL_MSK (0x3u)

/** \brief  Offset for Ifx_HSSL_SFSFLAGS_Bits.RXFL */
#define IFX_HSSL_SFSFLAGS_RXFL_OFF (0u)

/** \brief  Length for Ifx_HSSL_SFSFLAGS_Bits.TXFL */
#define IFX_HSSL_SFSFLAGS_TXFL_LEN (2u)

/** \brief  Mask for Ifx_HSSL_SFSFLAGS_Bits.TXFL */
#define IFX_HSSL_SFSFLAGS_TXFL_MSK (0x3u)

/** \brief  Offset for Ifx_HSSL_SFSFLAGS_Bits.TXFL */
#define IFX_HSSL_SFSFLAGS_TXFL_OFF (2u)

/** \brief  Length for Ifx_HSSL_T_TCA_Bits.A */
#define IFX_HSSL_T_TCA_A_LEN (32u)

/** \brief  Mask for Ifx_HSSL_T_TCA_Bits.A */
#define IFX_HSSL_T_TCA_A_MSK (0xffffffffu)

/** \brief  Offset for Ifx_HSSL_T_TCA_Bits.A */
#define IFX_HSSL_T_TCA_A_OFF (0u)

/** \brief  Length for Ifx_HSSL_T_TCD_Bits.D */
#define IFX_HSSL_T_TCD_D_LEN (32u)

/** \brief  Mask for Ifx_HSSL_T_TCD_Bits.D */
#define IFX_HSSL_T_TCD_D_MSK (0xffffffffu)

/** \brief  Offset for Ifx_HSSL_T_TCD_Bits.D */
#define IFX_HSSL_T_TCD_D_OFF (0u)

/** \brief  Length for Ifx_HSSL_TIDADD_Bits.A */
#define IFX_HSSL_TIDADD_A_LEN (32u)

/** \brief  Mask for Ifx_HSSL_TIDADD_Bits.A */
#define IFX_HSSL_TIDADD_A_MSK (0xffffffffu)

/** \brief  Offset for Ifx_HSSL_TIDADD_Bits.A */
#define IFX_HSSL_TIDADD_A_OFF (0u)

/** \brief  Length for Ifx_HSSL_TS_CA_Bits.CURR */
#define IFX_HSSL_TS_CA_CURR_LEN (27u)

/** \brief  Mask for Ifx_HSSL_TS_CA_Bits.CURR */
#define IFX_HSSL_TS_CA_CURR_MSK (0x7ffffffu)

/** \brief  Offset for Ifx_HSSL_TS_CA_Bits.CURR */
#define IFX_HSSL_TS_CA_CURR_OFF (5u)

/** \brief  Length for Ifx_HSSL_TS_FC_Bits.CURCOUNT */
#define IFX_HSSL_TS_FC_CURCOUNT_LEN (16u)

/** \brief  Mask for Ifx_HSSL_TS_FC_Bits.CURCOUNT */
#define IFX_HSSL_TS_FC_CURCOUNT_MSK (0xffffu)

/** \brief  Offset for Ifx_HSSL_TS_FC_Bits.CURCOUNT */
#define IFX_HSSL_TS_FC_CURCOUNT_OFF (16u)

/** \brief  Length for Ifx_HSSL_TS_FC_Bits.RELCOUNT */
#define IFX_HSSL_TS_FC_RELCOUNT_LEN (16u)

/** \brief  Mask for Ifx_HSSL_TS_FC_Bits.RELCOUNT */
#define IFX_HSSL_TS_FC_RELCOUNT_MSK (0xffffu)

/** \brief  Offset for Ifx_HSSL_TS_FC_Bits.RELCOUNT */
#define IFX_HSSL_TS_FC_RELCOUNT_OFF (0u)

/** \brief  Length for Ifx_HSSL_TSSA_Bits.ADDR */
#define IFX_HSSL_TSSA_ADDR_LEN (27u)

/** \brief  Mask for Ifx_HSSL_TSSA_Bits.ADDR */
#define IFX_HSSL_TSSA_ADDR_MSK (0x7ffffffu)

/** \brief  Offset for Ifx_HSSL_TSSA_Bits.ADDR */
#define IFX_HSSL_TSSA_ADDR_OFF (5u)

/** \brief  Length for Ifx_HSSL_TSTAT_Bits.LASTCC0 */
#define IFX_HSSL_TSTAT_LASTCC0_LEN (5u)

/** \brief  Mask for Ifx_HSSL_TSTAT_Bits.LASTCC0 */
#define IFX_HSSL_TSTAT_LASTCC0_MSK (0x1fu)

/** \brief  Offset for Ifx_HSSL_TSTAT_Bits.LASTCC0 */
#define IFX_HSSL_TSTAT_LASTCC0_OFF (0u)

