feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxHssl_bf.h
/** \brief  Length for Ifx_HSSL_TSTAT_Bits.LASTCC1 */
#define IFX_HSSL_TSTAT_LASTCC1_LEN (5u)

/** \brief  Mask for Ifx_HSSL_TSTAT_Bits.LASTCC1 */
#define IFX_HSSL_TSTAT_LASTCC1_MSK (0x1fu)

/** \brief  Offset for Ifx_HSSL_TSTAT_Bits.LASTCC1 */
#define IFX_HSSL_TSTAT_LASTCC1_OFF (8u)

/** \brief  Length for Ifx_HSSL_TSTAT_Bits.LASTCC2 */
#define IFX_HSSL_TSTAT_LASTCC2_LEN (5u)

/** \brief  Mask for Ifx_HSSL_TSTAT_Bits.LASTCC2 */
#define IFX_HSSL_TSTAT_LASTCC2_MSK (0x1fu)

/** \brief  Offset for Ifx_HSSL_TSTAT_Bits.LASTCC2 */
#define IFX_HSSL_TSTAT_LASTCC2_OFF (16u)

/** \brief  Length for Ifx_HSSL_TSTAT_Bits.LASTCC3 */
#define IFX_HSSL_TSTAT_LASTCC3_LEN (5u)

/** \brief  Mask for Ifx_HSSL_TSTAT_Bits.LASTCC3 */
#define IFX_HSSL_TSTAT_LASTCC3_MSK (0x1fu)

/** \brief  Offset for Ifx_HSSL_TSTAT_Bits.LASTCC3 */
#define IFX_HSSL_TSTAT_LASTCC3_OFF (24u)

/** \brief  Length for Ifx_HSSL_TSTAT_Bits.LASTTT0 */
#define IFX_HSSL_TSTAT_LASTTT0_LEN (3u)

/** \brief  Mask for Ifx_HSSL_TSTAT_Bits.LASTTT0 */
#define IFX_HSSL_TSTAT_LASTTT0_MSK (0x7u)

/** \brief  Offset for Ifx_HSSL_TSTAT_Bits.LASTTT0 */
#define IFX_HSSL_TSTAT_LASTTT0_OFF (5u)

/** \brief  Length for Ifx_HSSL_TSTAT_Bits.LASTTT1 */
#define IFX_HSSL_TSTAT_LASTTT1_LEN (3u)

/** \brief  Mask for Ifx_HSSL_TSTAT_Bits.LASTTT1 */
#define IFX_HSSL_TSTAT_LASTTT1_MSK (0x7u)

/** \brief  Offset for Ifx_HSSL_TSTAT_Bits.LASTTT1 */
#define IFX_HSSL_TSTAT_LASTTT1_OFF (13u)

/** \brief  Length for Ifx_HSSL_TSTAT_Bits.LASTTT2 */
#define IFX_HSSL_TSTAT_LASTTT2_LEN (3u)

/** \brief  Mask for Ifx_HSSL_TSTAT_Bits.LASTTT2 */
#define IFX_HSSL_TSTAT_LASTTT2_MSK (0x7u)

/** \brief  Offset for Ifx_HSSL_TSTAT_Bits.LASTTT2 */
#define IFX_HSSL_TSTAT_LASTTT2_OFF (21u)

/** \brief  Length for Ifx_HSSL_TSTAT_Bits.LASTTT3 */
#define IFX_HSSL_TSTAT_LASTTT3_LEN (3u)

/** \brief  Mask for Ifx_HSSL_TSTAT_Bits.LASTTT3 */
#define IFX_HSSL_TSTAT_LASTTT3_MSK (0x7u)

/** \brief  Offset for Ifx_HSSL_TSTAT_Bits.LASTTT3 */
#define IFX_HSSL_TSTAT_LASTTT3_OFF (29u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXHSSL_BF_H */
